lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_radiocore.svd
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The channel 26 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The channel 26 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_27</name>
                    <description>Channel number</description>
                    <lsb>27</lsb>
                    <msb>27</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The channel 27 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The channel 27 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_28</name>
                    <description>Channel number</description>
                    <lsb>28</lsb>
                    <msb>28</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The channel 28 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The channel 28 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_29</name>
                    <description>Channel number</description>
                    <lsb>29</lsb>
                    <msb>29</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The channel 29 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The channel 29 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_30</name>
                    <description>Channel number</description>
                    <lsb>30</lsb>
                    <msb>30</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The channel 30 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The channel 30 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_31</name>
                    <description>Channel number</description>
                    <lsb>31</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The channel 31 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The channel 31 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>INTERRUPT</name>
              <description>Unspecified</description>
              <headerStructName>UICR_IPCT_GLOBAL_INTERRUPT</headerStructName>
              <access>read-write</access>
              <addressOffset>0x00C</addressOffset>
              <register>
                <name>OWN</name>
                <description>Description cluster: Request ownership of the interrupts of IPCT[n] in Global domain</description>
                <addressOffset>0x000</addressOffset>
                <access>read-write</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>INT_0</name>
                    <description>Interrupt number</description>
                    <lsb>0</lsb>
                    <msb>0</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 0</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 0</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_1</name>
                    <description>Interrupt number</description>
                    <lsb>1</lsb>
                    <msb>1</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 1</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 1</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_2</name>
                    <description>Interrupt number</description>
                    <lsb>2</lsb>
                    <msb>2</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 2</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 2</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_3</name>
                    <description>Interrupt number</description>
                    <lsb>3</lsb>
                    <msb>3</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 3</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 3</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_4</name>
                    <description>Interrupt number</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 4</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 4</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_5</name>
                    <description>Interrupt number</description>
                    <lsb>5</lsb>
                    <msb>5</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 5</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 5</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_6</name>
                    <description>Interrupt number</description>
                    <lsb>6</lsb>
                    <msb>6</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 6</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 6</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_7</name>
                    <description>Interrupt number</description>
                    <lsb>7</lsb>
                    <msb>7</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 7</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 7</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_8</name>
                    <description>Interrupt number</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 8</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 8</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_9</name>
                    <description>Interrupt number</description>
                    <lsb>9</lsb>
                    <msb>9</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 9</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 9</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_10</name>
                    <description>Interrupt number</description>
                    <lsb>10</lsb>
                    <msb>10</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 10</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 10</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_11</name>
                    <description>Interrupt number</description>
                    <lsb>11</lsb>
                    <msb>11</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 11</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 11</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_12</name>
                    <description>Interrupt number</description>
                    <lsb>12</lsb>
                    <msb>12</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 12</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 12</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_13</name>
                    <description>Interrupt number</description>
                    <lsb>13</lsb>
                    <msb>13</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 13</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 13</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_14</name>
                    <description>Interrupt number</description>
                    <lsb>14</lsb>
                    <msb>14</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 14</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 14</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_15</name>
                    <description>Interrupt number</description>
                    <lsb>15</lsb>
                    <msb>15</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 15</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 15</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_16</name>
                    <description>Interrupt number</description>
                    <lsb>16</lsb>
                    <msb>16</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 16</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 16</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_17</name>
                    <description>Interrupt number</description>
                    <lsb>17</lsb>
                    <msb>17</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 17</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 17</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_18</name>
                    <description>Interrupt number</description>
                    <lsb>18</lsb>
                    <msb>18</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 18</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 18</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_19</name>
                    <description>Interrupt number</description>
                    <lsb>19</lsb>
                    <msb>19</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 19</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 19</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_20</name>
                    <description>Interrupt number</description>
                    <lsb>20</lsb>
                    <msb>20</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 20</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 20</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_21</name>
                    <description>Interrupt number</description>
                    <lsb>21</lsb>
                    <msb>21</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 21</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 21</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_22</name>
                    <description>Interrupt number</description>
                    <lsb>22</lsb>
                    <msb>22</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the interrupt 22</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the interrupt 22</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
