lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_radiocore.svd
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_23</name>
                      <description>Link enable</description>
                      <lsb>23</lsb>
                      <msb>23</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 23 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 23 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_24</name>
                      <description>Link enable</description>
                      <lsb>24</lsb>
                      <msb>24</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 24 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 24 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_25</name>
                      <description>Link enable</description>
                      <lsb>25</lsb>
                      <msb>25</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 25 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 25 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_26</name>
                      <description>Link enable</description>
                      <lsb>26</lsb>
                      <msb>26</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 26 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 26 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_27</name>
                      <description>Link enable</description>
                      <lsb>27</lsb>
                      <msb>27</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 27 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 27 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_28</name>
                      <description>Link enable</description>
                      <lsb>28</lsb>
                      <msb>28</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 28 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 28 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_29</name>
                      <description>Link enable</description>
                      <lsb>29</lsb>
                      <msb>29</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 29 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 29 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_30</name>
                      <description>Link enable</description>
                      <lsb>30</lsb>
                      <msb>30</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 30 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 30 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_31</name>
                      <description>Link enable</description>
                      <lsb>31</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 31 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 31 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
