lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_radiocore.svd
                <register>
                  <name>EN</name>
                  <description>Description cluster: Request linking of the channels of DPPI[n] in the Global domain</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-write</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>CH_0</name>
                      <description>Link enable</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 0 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 0 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_1</name>
                      <description>Link enable</description>
                      <lsb>1</lsb>
                      <msb>1</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 1 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 1 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_2</name>
                      <description>Link enable</description>
                      <lsb>2</lsb>
                      <msb>2</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 2 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 2 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_3</name>
                      <description>Link enable</description>
                      <lsb>3</lsb>
                      <msb>3</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 3 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 3 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_4</name>
                      <description>Link enable</description>
                      <lsb>4</lsb>
                      <msb>4</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 4 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 4 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_5</name>
                      <description>Link enable</description>
                      <lsb>5</lsb>
                      <msb>5</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 5 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 5 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_6</name>
                      <description>Link enable</description>
                      <lsb>6</lsb>
                      <msb>6</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 6 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 6 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_7</name>
                      <description>Link enable</description>
                      <lsb>7</lsb>
                      <msb>7</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 7 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 7 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_8</name>
                      <description>Link enable</description>
                      <lsb>8</lsb>
                      <msb>8</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 8 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 8 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_9</name>
                      <description>Link enable</description>
                      <lsb>9</lsb>
                      <msb>9</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 9 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 9 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_10</name>
                      <description>Link enable</description>
                      <lsb>10</lsb>
                      <msb>10</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 10 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 10 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_11</name>
                      <description>Link enable</description>
                      <lsb>11</lsb>
                      <msb>11</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 11 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 11 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_12</name>
                      <description>Link enable</description>
                      <lsb>12</lsb>
                      <msb>12</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 12 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 12 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_13</name>
                      <description>Link enable</description>
                      <lsb>13</lsb>
                      <msb>13</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 13 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 13 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_14</name>
                      <description>Link enable</description>
                      <lsb>14</lsb>
                      <msb>14</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 14 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 14 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_15</name>
                      <description>Link enable</description>
                      <lsb>15</lsb>
                      <msb>15</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 15 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 15 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_16</name>
                      <description>Link enable</description>
                      <lsb>16</lsb>
                      <msb>16</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 16 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 16 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_17</name>
                      <description>Link enable</description>
                      <lsb>17</lsb>
                      <msb>17</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 17 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 17 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_18</name>
                      <description>Link enable</description>
                      <lsb>18</lsb>
                      <msb>18</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 18 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 18 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_19</name>
                      <description>Link enable</description>
                      <lsb>19</lsb>
                      <msb>19</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 19 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 19 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_20</name>
                      <description>Link enable</description>
                      <lsb>20</lsb>
                      <msb>20</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 20 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 20 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_21</name>
                      <description>Link enable</description>
                      <lsb>21</lsb>
                      <msb>21</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 21 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 21 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_22</name>
                      <description>Link enable</description>
                      <lsb>22</lsb>
                      <msb>22</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 22 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 22 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_23</name>
                      <description>Link enable</description>
                      <lsb>23</lsb>
                      <msb>23</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 23 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 23 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_24</name>
                      <description>Link enable</description>
                      <lsb>24</lsb>
                      <msb>24</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 24 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 24 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_25</name>
                      <description>Link enable</description>
                      <lsb>25</lsb>
                      <msb>25</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 25 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 25 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_26</name>
                      <description>Link enable</description>
                      <lsb>26</lsb>
                      <msb>26</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 26 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 26 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_27</name>
                      <description>Link enable</description>
                      <lsb>27</lsb>
                      <msb>27</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 27 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 27 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
