lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_radiocore.svd
        <register>
          <name>GHWCFG4</name>
          <description>User Hardware Configuration 4 Register</description>
          <addressOffset>0x050</addressOffset>
          <access>read-write</access>
          <resetValue>0x1FF0AA60</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>NUMDEVPERIOEPS</name>
              <description>Number of Device Mode Periodic IN Endpoints (NumDevPerioEps)</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Value0</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value1</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value2</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value3</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value4</name>
                  <description>Unspecified</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value5</name>
                  <description>Unspecified</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value6</name>
                  <description>Unspecified</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value7</name>
                  <description>Unspecified</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value8</name>
                  <description>Unspecified</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value9</name>
                  <description>Unspecified</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value10</name>
                  <description>Unspecified</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value11</name>
                  <description>Unspecified</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value12</name>
                  <description>Unspecified</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value13</name>
                  <description>Unspecified</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value14</name>
                  <description>Unspecified</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value15</name>
                  <description>Unspecified</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARTIALPWRDN</name>
              <description>Enable Partial Power Down (PartialPwrDn)</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHBFREQ</name>
              <description>Minimum AHB Frequency Less Than 60 MHz (AhbFreq)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIBERNATION</name>
              <description>Enable Hibernation (Hibernation)</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTENDEDHIBERNATION</name>
              <description>Enable Hibernation</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENHANCEDLPMSUPT1</name>
              <description>Enhanced LPM Support1 (EnhancedLPMSupt1)</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SERVINTFLOW</name>
              <description>Service Interval Flow</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPGISOCSUPT</name>
              <description>Interpacket Gap ISOC OUT Worst-case Support (ipgisocSupt)</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACGSUPT</name>
              <description>Active Clock Gating Support</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENHANCEDLPMSUPT</name>
              <description>Enhanced LPM Support (EnhancedLPMSupt)</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYDATAWIDTH</name>
              <description>UTMI+ PHY/ULPI-to-Internal UTMI+ Wrapper Data Width</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIDTH1</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIDTH2</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIDTH3</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUMCTLEPS</name>
              <description>Number of Device Mode Control Endpoints in Addition to</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENDPT0</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT1</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT2</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT3</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT4</name>
                  <description>Unspecified</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT5</name>
                  <description>Unspecified</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT6</name>
                  <description>Unspecified</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT7</name>
                  <description>Unspecified</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT8</name>
                  <description>Unspecified</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT9</name>
                  <description>Unspecified</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT10</name>
                  <description>Unspecified</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT11</name>
                  <description>Unspecified</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT12</name>
                  <description>Unspecified</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT13</name>
                  <description>Unspecified</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT14</name>
                  <description>Unspecified</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT15</name>
                  <description>Unspecified</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDDGFLTR</name>
              <description>IDDIG Filter Enable (IddgFltr)</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALIDFLTR</name>
              <description>VBUS Valid Filter Enabled (VBusValidFltr)</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVALIDFLTR</name>
              <description>a_valid Filter Enabled (AValidFltr)</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BVALIDFLTR</name>
              <description>b_valid Filter Enabled (BValidFltr)</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SESSENDFLTR</name>
              <description>session_end Filter Enabled (SessEndFltr)</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEDFIFOMODE</name>
              <description>Enable Dedicated Transmit FIFO for device IN Endpoints</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPS</name>
              <description>Number of Device Mode IN Endpoints Including Control Endpoints (INEps)</description>
              <lsb>26</lsb>
              <msb>29</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENDPT1</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT2</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT3</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT4</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT5</name>
                  <description>Unspecified</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT6</name>
                  <description>Unspecified</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT7</name>
                  <description>Unspecified</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT8</name>
                  <description>Unspecified</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT9</name>
                  <description>Unspecified</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT10</name>
                  <description>Unspecified</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT11</name>
                  <description>Unspecified</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT12</name>
                  <description>Unspecified</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT13</name>
                  <description>Unspecified</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT14</name>
                  <description>Unspecified</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT15</name>
                  <description>Unspecified</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT16</name>
                  <description>Unspecified</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DESCDMAENABLED</name>
              <description>Scatter/Gather DMA configuration</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
