lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_radiocore.svd
        <register>
          <name>PCGCCTL</name>
          <description>Power and Clock Gating Control Register</description>
          <addressOffset>0xE00</addressOffset>
          <access>read-write</access>
          <resetValue>0x880A0000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STOPPCLK</name>
              <description>Stop Pclk (StopPclk)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTPDWNMODULE</name>
              <description>Reset Power-Down Modules (RstPdwnModule)</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENBLL1GATING</name>
              <description>Enable Sleep Clock Gating</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYSLEEP</name>
              <description>PHY In Sleep</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L1SUSPENDED</name>
              <description>L1 Deep Sleep</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTOREMODE</name>
              <description>Restore Mode (RestoreMode)</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ESSREGRESTORED</name>
              <description>Essential Register Values Restored (EssRegRestored)</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_RESTORED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESTORED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTOREVALUE</name>
              <description>Restore Value (RestoreValue)</description>
              <lsb>14</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>16</dim>
          <dimIncrement>0x1004</dimIncrement>
          <name>DWCOTGDFIFO[%s]</name>
          <description>Unspecified</description>
          <headerStructName>USBHSCORE_DWCOTGDFIFO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1000</addressOffset>
          <register>
            <dim>0x401</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DATA[%s]</name>
            <description>Description collection: Data buffer for FIFO n</description>
            <addressOffset>0x0000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
          </register>
        </cluster>
        <cluster>
          <name>DWCOTGDFIFODIRECTACCESS</name>
          <description>Unspecified</description>
          <headerStructName>USBHSCORE_DWCOTGDFIFODIRECTACCESS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x20000</addressOffset>
          <register>
            <dim>0x1001</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DATA[%s]</name>
            <description>Description collection: Data buffer FIFO Direct Access</description>
            <addressOffset>0x00000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
          </register>
        </cluster>
