lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_radiocore.svd
          <register>
            <name>SLVMIPIIDVALUE</name>
            <description>I3C MIPI Manufacturer ID Register.</description>
            <addressOffset>0x070</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SLVPROVIDSEL</name>
                <description>Specifies the Provisional ID Type Selector (PID[32]).</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>SLVMIPIMFGID</name>
                <description>Specifies the MIPI Manufacturer ID.</description>
                <lsb>1</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SLVPIDVALUE</name>
            <description>I3C Normal Provisional ID Register.</description>
            <addressOffset>0x074</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SLVPIDDCR</name>
                <description>Specifies the additional 12-bit ID of DWC_mipi_i3c device (PID[11:0]).</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>SLVINSTID</name>
                <description>This field is used to program the instance ID of the Slave.</description>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>SLVPARTID</name>
                <description>Specifies the Part ID of DWC_mipi_i3c device (PID[31:16])</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SLVCHARCTRL</name>
            <description>I3C Slave Characteristic Register.</description>
            <addressOffset>0x078</addressOffset>
            <access>read-write</access>
            <resetValue>0x00070062</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAXDATASPEEDLIMIT</name>
                <description>Max Data Speed Limitation field in Bus Characteristic Register (BCR[0]).</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>IBIREQUESTCAPABLE</name>
                <description>IBI Request Capable field in Bus Characteristic Register (BCR[1]).</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>IBIPAYLOAD</name>
                <description>IBI Payload field in Bus Characteristic Register (BCR[2]).</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>OFFLINECAPABLE</name>
                <description>Offline Capable field in Bus Characteristic Register (BCR[3]).</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BRIDGEIDENTIFIER</name>
                <description>Bridge Identifier field in Bus Characteristic Register (BCR[4]).</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>HDRCAPABLE</name>
                <description>SDR Only or SDR and HDR Capable field in Bus Characteristic Register (BCR[5]).</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>DEVICEROLE</name>
                <description>Device Role field in Bus Characteristic Register (BCR[7:6]).</description>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>DCR</name>
                <description>I3C Device Characteristic Value.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>HDRCAP</name>
                <description>I3C Device HDR Capability Register Value.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SLVMAXLEN</name>
            <description>I3C Max Write/Read Length Register.</description>
            <addressOffset>0x07C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00FF00FF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MWL</name>
                <description>I3C Device Max Write Length</description>
                <lsb>0</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>MRL</name>
                <description>I3C Device Max Read Length.</description>
                <lsb>16</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXREADTURNAROUND</name>
            <description>MXDS Maximum Read Turnaround Time.</description>
            <addressOffset>0x080</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MXDSMAXRDTURN</name>
                <description>Specifies the maximum read turnaround time (in microseconds (us)) of DWC_mipi_i3c Slave.</description>
                <lsb>0</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXDATASPEED</name>
            <description>The values in this register are returned by the slave as GETACCMST CCC data.</description>
            <addressOffset>0x084</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MXDSMAXWRSPEED</name>
                <description>Specifies the Maximum Sustained Data Rate for non-CCC messages sent by Master Device to DWC_mipi_i3c Slave device</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>12M5HZ</name>
                    <description>12.5MHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8MHZ</name>
                    <description>8MHZ</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>6MHZ</name>
                    <description>6MHz</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4MHZ</name>
                    <description>4MHz</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2MHZ</name>
                    <description>2MHz</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MXDSMAXRDSPEED</name>
                <description>Specifies the Maximum Sustained Data Rate for non-CCC messages sent by DWC_mipi_i3c Slave Device to Master Device</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>12M5HZ</name>
                    <description>12.5MHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8MHZ</name>
                    <description>8MHZ</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>6MHZ</name>
                    <description>6MHz</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4MHZ</name>
                    <description>4MHz</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2MHZ</name>
                    <description>2MHz</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MXDSCLKDATATURN</name>
                <description>Specifies the clock to data turnaround time (Tsco parameter) of DWC_mipi_i3c Slave device</description>
                <lsb>16</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>8NS</name>
                    <description>8ns</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>9NS</name>
                    <description>9ns</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10NS</name>
                    <description>10ns</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>11NS</name>
                    <description>11ns</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>12NS</name>
                    <description>12ns</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SLVINTRREQ</name>
            <description>This register is used in slave mode of operation.</description>
            <addressOffset>0x08C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SIR</name>
                <description>Slave Interrupt Request</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>SIRCTRL</name>
                <description>Slave Interrupt Request Control</description>
                <lsb>1</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SEND</name>
                    <description>Send the Assigned Dynamic Address</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MR</name>
                <description>Master Request</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>IBISTS</name>
                <description>IBI Completion Status</description>
                <lsb>8</lsb>
                <msb>9</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ACCEPTED</name>
                    <description>IBI accepted by the Master (ACK response received)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NOATTEMPT</name>
                    <description>IBI Not Attempted</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SLVTSXSYMBLTIMING</name>
            <description>TSP/TSL Symbol Timing Register</description>
            <addressOffset>0x090</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000003F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SLVTSXSYMBLCNT</name>
                <description>TSP/TSL Symbol Count Value.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEVICECTRLEXTENDED</name>
            <description>Device Control Extended register.</description>
            <addressOffset>0x0B0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DEVOPERATIONMODE</name>
                <description>This bit is used to select the Device Operation Mode before the controller is enabled.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MASTER</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SLAVE</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REQMSTACKCTRL</name>
                <description>In Slave mode of operation, this bit serves as a control to ACK/NACK GETACCMST CCC from current master.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ACK</name>
                    <description>ACK GETACCMST CCC</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NACK</name>
                    <description>NACK GETACCMST CCC</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SCLI3CODTIMING</name>
            <description>SCL I3C Open Drain Timing Register</description>
            <addressOffset>0x0B4</addressOffset>
            <access>read-write</access>
            <resetValue>0x000A0010</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>I3CODLCNT</name>
                <description>I3C Open Drain Low Count.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>I3CODHCNT</name>
                <description>I3C Open Drain High Count.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SCLI3CPPTIMING</name>
            <description>SCL I3C Push Pull Timing Register</description>
            <addressOffset>0x0B8</addressOffset>
            <access>read-write</access>
            <resetValue>0x000A000A</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>I3CPPLCNT</name>
                <description>I3C Push Pull Low Count.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>I3CPPHCNT</name>
                <description>I3C Push Pull High Count.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SCLI2CFMTIMING</name>
            <description>SCL I2C Fast Mode Timing Register</description>
            <addressOffset>0x0BC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00100010</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>I2CFMLCNT</name>
                <description>I2C Fast Mode Low Count</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>I2CFMHCNT</name>
                <description>I2C Fast Mode High Count</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SCLI2CFMPTIMING</name>
            <description>SCL I2C Fast Mode Plus Timing Register</description>
            <addressOffset>0x0C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00100010</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>I2CFMPLCNT</name>
                <description>I2C Fast Mode Plus Low Count</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>I2CFMPHCNT</name>
                <description>I2C Fast Mode Plus High Count</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SCLEXTLCNTTIMING</name>
            <description>SCL Extended Low Count Timing Register.</description>
            <addressOffset>0x0C8</addressOffset>
            <access>read-write</access>
            <resetValue>0x20202020</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>I3CEXTLCNT1</name>
                <description>I3C Extended Low Count Register 1</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>I3CEXTLCNT2</name>
                <description>I3C Extended Low Count Register 2</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>I3CEXTLCNT3</name>
                <description>I3C Extended Low Count Register 3</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>I3CEXTLCNT4</name>
                <description>I3C Extended Low Count Register 4</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SCLEXTTERMNLCNTTIMING</name>
            <description>SCL Termination Bit Low Count Timing Register</description>
            <addressOffset>0x0CC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00030000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>I3CEXTTERMNLCNT</name>
                <description>I3C Read Termination Bit Low count.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>I3CTSSKEWCNT</name>
                <description>I3C HDR Ternary Skew Count.</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SDAHOLDSWITCHDLYTIMING</name>
            <description>SDA Hold and Mode Switch Delay Timing Register</description>
            <addressOffset>0x0D0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00010000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SDATXHOLD</name>
                <description>This field controls the hold time (in term of the core clock period) of the transmit data (SDA) with</description>
                <lsb>16</lsb>
                <msb>18</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUSFREEAVAILTIMING</name>
            <description>Bus Free and Available Timing Register</description>
            <addressOffset>0x0D4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00200020</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BUSFREETIME</name>
                <description>This register field is used only in Master mode of operation</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>BUSAVAILABLETIME</name>
                <description>This register field is used only in Slave mode of operation</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUSIDLETIMING</name>
            <description>Bus Idle Timing Register</description>
            <addressOffset>0x0D8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000020</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BUSIDLETIME</name>
                <description>Bus Idle Count Value.</description>
                <lsb>0</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
