lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_radiocore.svd
          <cluster>
            <name>BELLS</name>
            <description>Unspecified</description>
            <headerStructName>SPU_FEATURE_BELLS</headerStructName>
            <alternateCluster>STRUCT0</alternateCluster>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <cluster>
              <dim>16</dim>
              <dimIncrement>0x040</dimIncrement>
              <name>DOMAIN[%s]</name>
              <description>Unspecified</description>
              <headerStructName>SPU_FEATURE_BELLS_DOMAIN</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <register>
                <dim>0x10</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>BELL[%s]</name>
                <description>Description collection: Configuration of features for bell pair [(o * 2) + 1:o * 2] of domain n</description>
                <addressOffset>0x000</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>SECATTR</name>
                    <description>SECATTR feature</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>Feature is available for non-secure usage</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>Feature is reserved for secure usage</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>LOCK feature</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unlocked</name>
                        <description>Feature permissions can be updated</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Locked</name>
                        <description>Feature permissions can not be changed until the next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>OWNERID</name>
                    <description>Feature owner ID</description>
                    <lsb>16</lsb>
                    <msb>19</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>MPC_S</name>
      <description>Memory Privilege Controller</description>
      <baseAddress>0x53001000</baseAddress>
      <headerStructName>MPC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MPC</name>
        <value>1</value>
      </interrupt>
      <groupName>MPC</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>EVENTS_MEMACCERR</name>
          <description>Memory Access Error event</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_MEMACCERR</name>
              <description>Memory Access Error event</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Enable or disable interrupt</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MEMACCERR</name>
              <description>Enable or disable interrupt for event MEMACCERR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MEMACCERR</name>
              <description>Write '1' to enable interrupt for event MEMACCERR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MEMACCERR</name>
              <description>Write '1' to disable interrupt for event MEMACCERR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>MEMACCERR</name>
          <description>Memory Access Error status registers</description>
          <headerStructName>MPC_MEMACCERR</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>ADDRESS</name>
            <description>Target Address of Memory Access Error. Register content won't be changed as long as MEMACCERR event is active.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Target address for erroneous access</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INFO</name>
            <description>Access information for the transaction that triggered a memory access error. Register content won't be changed as long as MEMACCERR event is active.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OWNERID</name>
                <description>Owner identifier of the erroneous access</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>MASTERPORT</name>
                <description>Master port where erroneous access is detected</description>
                <lsb>4</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>READ</name>
                <description>Read bit of bus access</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Read access bit was set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NotSet</name>
                    <description>Read access bit was not set</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRITE</name>
                <description>Write bit of bus access</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Write access bit was set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NotSet</name>
                    <description>Write access bit was not set</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EXECUTE</name>
                <description>Execute bit of bus access</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Execute access bit was set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NotSet</name>
                    <description>Execute access bit was not set</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECURE</name>
                <description>Secure bit of bus access</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Secure access bit was set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NotSet</name>
                    <description>Secure access bit was not set</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ERRORSOURCE</name>
                <description>Source of memory access error</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MPC</name>
                    <description>Error was triggered by MPC module</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Slave</name>
                    <description>Error was triggered by an AXI slave</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
