lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_radiocore.svd
          <register>
            <name>SINKJOBCOUNT</name>
            <description>Number of completed jobs in the current Sink descriptor list.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COUNT</name>
                <description>Sink job count</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>CONFIG</name>
          <description>MVDMA configuration registers.</description>
          <headerStructName>MVDMA_CONFIG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x504</addressOffset>
          <register>
            <name>MODE</name>
            <description>Mode that defines where the job list pointers are located.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MODE</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SingleMode</name>
                    <description>Registers CONFIG.SOURCELISTPTR and CONFIG.SINKLISTPTR contain start address of a single job list.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MultiMode</name>
                    <description>Registers CONFIG.SOURCELISTPTR and CONFIG.SINKLISTPTR contain start address of a list of job list pointers in memory.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SOURCELISTPTR</name>
            <description>Start address of Source job list or list of job list pointers, depending on value of CONFIG.MODE.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Source job descriptor list address.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SINKLISTPTR</name>
            <description>Start address of Sink job list or list of job list pointers, depending on value of CONFIG.MODE.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Sink descriptor list address.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral derivedFrom="MVDMA_NS">
      <name>MVDMA_S</name>
      <description>MVDMA performs direct-memory-accesses between memories. Data is transferred according to job descriptor lists.  Each transfer has corresponding source and sink descriptor lists with matching data amounts. The lists are in memory and they contain data buffer information, address pointers, buffer sizes and data type attributes. 1</description>
      <baseAddress>0x53003000</baseAddress>
      <!--Security dma=NSA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>MVDMA</name>
        <value>3</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>RAMC000_NS</name>
      <description>RAM Controller 0</description>
      <baseAddress>0x43004000</baseAddress>
      <headerStructName>RAMC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>RAMC</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>WAITSTATES</name>
          <description>Waitstates for read operations.</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>WAITSTATES</name>
              <description>Number of waitstates for a read from the RAM.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SECBASE</name>
          <description>Base address for secure access area.</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Base address</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SECENABLE</name>
          <description>Enable secure access restrictions.</description>
          <addressOffset>0x604</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable secure access restrictions</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Secure access restrictions disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Secure access restrictions enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
