lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_radiocore.svd
          <register>
            <name>ABSTRACTCS</name>
            <description>Abstract Control and Status</description>
            <addressOffset>0x58</addressOffset>
            <access>read-write</access>
            <resetValue>0x01000002</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATACOUNT</name>
                <description>Number of data registers that are implemented as part of the abstract command interface. Valid sizes are 1..12.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CMDERR</name>
                <description>Command error when the abstract command fails.</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoError</name>
                    <description>No error.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Busy</name>
                    <description>An abstract command was executing while command, 
                abstractcs, or abstractauto was written, or when one of the data or progbuf registers was read 
                or written. This status is only written if cmderr contains 0</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NotSupported</name>
                    <description>The requested command is notsupported,
                regardless of whether the hart is running or not.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Exception</name>
                    <description>An exception occurred while executing the 
                command  (e.g. while executing theProgram Buffer).</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HaltResume</name>
                    <description>The abstract command couldn't execute 
                because the hart wasn't in the required state (running/halted). or unavailable.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Bus</name>
                    <description>The abstract command failed due to abus 
                error (e.g. alignment, access size, or timeout).</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Other</name>
                    <description>The command failed for another reason.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BUSY</name>
                <description>Abstract command execution status.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotBusy</name>
                    <description>Not busy.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Busy</name>
                    <description>An abstract command is currently being executed.
            This bit is set as soon as command is written, and is not cleared until that command has completed.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PROGBUFSIZE</name>
                <description>Size of the Program Buffer, in 32-bit words. Valid sizes are 0 - 1.</description>
                <lsb>24</lsb>
                <msb>28</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ABSTRACTCMD</name>
            <description>Abstract command</description>
            <addressOffset>0x5C</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONTROL</name>
                <description>This Field is interpreted in a command specific manner, described for each abstract command.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>CMDTYPE</name>
                <description>The type determines the overall functionality of this abstract command.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>REGACCESS</name>
                    <description>Register Access Command</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>QUICKACCESS</name>
                    <description>Quick Access Command</description>
                    <value>0x01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MEMACCESS</name>
                    <description>Memory Access Command</description>
                    <value>0x02</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ABSTRACTAUTO</name>
            <description>Abstract Command Autoexec</description>
            <addressOffset>0x60</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AUTOEXECDATA</name>
                <description>When a bit in this field is 1, read or write accesses to the corresponding data word cause the
          command in command to be executed again.</description>
                <lsb>0</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>AUTOEXECPROGBUF</name>
                <description>When a bit in this field is 1, read or write accesses to the corresponding progbuf word cause
          the command in command to be executed again.</description>
                <lsb>16</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>CONFSTRPTR[%s]</name>
            <description>Description collection: Configuration String Pointer [n]</description>
            <addressOffset>0x64</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Address</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>NEXTDM</name>
            <description>Next Debug Module</description>
            <addressOffset>0x74</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Address</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x10</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PROGBUF[%s]</name>
            <description>Description collection: Program Buffer [n]</description>
            <addressOffset>0x80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AUTHDATA</name>
            <description>Authentication Data</description>
            <addressOffset>0xC0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HALTSUM2</name>
            <description>Halt Summary 2</description>
            <addressOffset>0xD0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HALTSUM2</name>
                <description>Halt Summary 2</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HALTSUM3</name>
            <description>Halt Summary 3</description>
            <addressOffset>0xD4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HALTSUM3</name>
                <description>Halt Summary 3</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SBADDRESS3</name>
            <description>System Bus Addres 127:96</description>
            <addressOffset>0xDC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Accesses bits 127:96 of the physical address in
          sbaddress (if the system address bus is that
          wide).</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SBCS</name>
            <description>System Bus Access Control and Status</description>
            <addressOffset>0xE0</addressOffset>
            <access>read-write</access>
            <resetValue>0x20000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SBACCESS8</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>sbaccess8</name>
                    <description>8-bit system bus accesses are supported.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SBACCESS16</name>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>sbaccess16</name>
                    <description>16-bit system bus accesses are supported.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SBACCESS32</name>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>sbaccess32</name>
                    <description>32-bit system bus accesses are supported.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SBACCESS64</name>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>sbaccess64</name>
                    <description>64-bit system bus accesses are supported.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SBACCESS128</name>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>sbaccess128</name>
                    <description>128-bit system bus accesses are supported.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SBASIZE</name>
                <description>Width of system bus addresses in bits. (0 indicates there is no bus access support.)</description>
                <lsb>5</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SBERROR</name>
                <lsb>12</lsb>
                <msb>14</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Normal</name>
                    <description>There was no bus error.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Timeout</name>
                    <description>There was a timeout.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Address</name>
                    <description>A bad address was accessed.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Alignment</name>
                    <description>There was an alignment error.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Size</name>
                    <description>An access of unsupported size was requested.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Other</name>
                    <description>Other.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SBREADONDATA</name>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>sbreadondata</name>
                    <description>Every read from sbdata0 automatically
          triggers a system bus read at the (possibly autoincremented) address.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SBAUTOINCREMENT</name>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>sbautoincrement</name>
                    <description>sbaddress is incremented by the access
          size (in bytes) selected in sbaccess after every system bus access.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SBACCESS</name>
                <lsb>17</lsb>
                <msb>19</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>size8</name>
                    <description>8-bit.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>size16</name>
                    <description>16-bit.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>size32</name>
                    <description>32-bit.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>size64</name>
                    <description>64-bit.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>size128</name>
                    <description>128-bit.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SBREADONADDR</name>
                <lsb>20</lsb>
                <msb>20</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>sbreadonaddr</name>
                    <description>Every write to sbaddress0 automatically
          triggers a system bus read at the new address.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SBBUSY</name>
                <lsb>21</lsb>
                <msb>21</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>notbusy</name>
                    <description>System bus master is not busy.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>busy</name>
                    <description>System bus master is busy.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SBBUSYERROR</name>
                <lsb>22</lsb>
                <msb>22</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>noerror</name>
                    <description>No error.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>error</name>
                    <description>Debugger access attempted while one in progress.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SBVERSION</name>
                <lsb>29</lsb>
                <msb>31</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>version0</name>
                    <description>The System Bus interface conforms to mainline
          drafts of thia RISC-V External Debug Support spec older than 1 January, 2018.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>version1</name>
                    <description>The System Bus interface conforms to RISC-V External Debug Support version 0.14.0-DRAFT.
          Other values are reserved for future versions.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SBADDRESS0</name>
            <description>System Bus Addres 31:0</description>
            <addressOffset>0xE4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Accesses bits 31:0 of the physical address in
          sbaddress.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SBADDRESS1</name>
            <description>System Bus Addres 63:32</description>
            <addressOffset>0xE8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Accesses bits 63:32 of the physical address in
          sbaddress (if the system address bus is that
          wide).</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
