lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_radiocore.svd
          <register>
            <name>SBADDRESS2</name>
            <description>System Bus Addres 95:64</description>
            <addressOffset>0xEC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Accesses bits 95:64 of the physical address in
          sbaddress (if the system address bus is that
          wide).</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SBDATA0</name>
            <description>System Bus Data 31:0</description>
            <addressOffset>0xF0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Accesses bits 31:0 of sbdata</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SBDATA1</name>
            <description>System Bus Data 63:32</description>
            <addressOffset>0xF4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Accesses bits 63:32 of sbdata (if the system bus
          is that wide).</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SBDATA2</name>
            <description>System Bus Data 95:64</description>
            <addressOffset>0xF8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Accesses bits 95:64 of sbdata (if the system bus
          is that wide).</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SBDATA3</name>
            <description>System Bus Data 127:96</description>
            <addressOffset>0xFC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Accesses bits 127:96 of sbdata (if the system bus
          is that wide).</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HALTSUM0</name>
            <description>Halt summary 0</description>
            <addressOffset>0x100</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HALTSUM0</name>
                <description>Halt summary 0</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CPURUN</name>
          <description>State of the CPU after a core reset</description>
          <addressOffset>0x800</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Controls CPU running state after a core reset.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Stopped</name>
                  <description>CPU stopped. If this is the CPU state after a core reset, setting this bit will change the CPU state to CPU running.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Running</name>
                  <description>CPU running. If this is the CPU state after a core reset, clearing this bit will change the CPU state to CPU stopped after a core reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INITPC</name>
          <description>Initial value of the PC at CPU start.</description>
          <addressOffset>0x808</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INITPC</name>
              <description>Initial value of the PC at CPU start.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="VPR_NS">
      <name>VPR_S</name>
      <description>VPR peripheral registers 1</description>
      <baseAddress>0x53034000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>VPR</name>
        <value>52</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="RAMC000_NS">
      <name>RAMC001_NS</name>
      <description>RAM Controller 2</description>
      <baseAddress>0x43038000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="RAMC000_NS">
      <name>RAMC001_S</name>
      <description>RAM Controller 3</description>
      <baseAddress>0x53038000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="AAR020_NS">
      <name>AAR030_NS</name>
      <description>Accelerated Address Resolver 2</description>
      <baseAddress>0x4303A000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>AAR030_CCM030</name>
        <value>58</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="CCM020_NS">
      <name>CCM030_NS</name>
      <description>AES CCM Mode Encryption 2</description>
      <baseAddress>0x4303A000</baseAddress>
      <alternatePeripheral>AAR030_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>AAR030_CCM030</name>
        <value>58</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="AAR020_NS">
      <name>AAR030_S</name>
      <description>Accelerated Address Resolver 3</description>
      <baseAddress>0x5303A000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>AAR030_CCM030</name>
        <value>58</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="CCM020_NS">
      <name>CCM030_S</name>
      <description>AES CCM Mode Encryption 3</description>
      <baseAddress>0x5303A000</baseAddress>
      <alternatePeripheral>AAR030_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>AAR030_CCM030</name>
        <value>58</value>
      </interrupt>
    </peripheral>
