lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_radiocore.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_EXMIF_NS">
      <name>GLOBAL_EXMIF_S</name>
      <description>External Memory Interface 1</description>
      <baseAddress>0x5F095000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EXMIF</name>
        <value>149</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_SECDOMBELLBOARD_NS</name>
      <description>BELLBOARD public registers 0</description>
      <baseAddress>0x4F099000</baseAddress>
      <headerStructName>BELLBOARDPUBLIC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>BELLBOARDPUBLIC</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_TRIGGER[%s]</name>
          <description>Description collection: Task TRIGGER[n]</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_TRIGGER</name>
              <description>Task TRIGGER[n]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SECDOMBELLBOARD_NS">
      <name>GLOBAL_SECDOMBELLBOARD_S</name>
      <description>BELLBOARD public registers 1</description>
      <baseAddress>0x5F099000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral>
      <name>GLOBAL_VPR120_NS</name>
      <description>VPR peripheral registers 0</description>
      <baseAddress>0x4F8C9000</baseAddress>
      <headerStructName>VPRPUBLIC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>VPRPUBLIC</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_TRIGGER[%s]</name>
          <description>Description collection: VPR task [n] register</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_TRIGGER</name>
              <description>VPR task [n] register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_VPR120_NS">
      <name>GLOBAL_VPR120_S</name>
      <description>VPR peripheral registers 1</description>
      <baseAddress>0x5F8C9000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral>
      <name>GLOBAL_IPCT120_NS</name>
      <description>IPCT APB registers 0</description>
      <baseAddress>0x4F8D1000</baseAddress>
      <headerStructName>IPCT</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>IPCT120_0</name>
        <value>209</value>
      </interrupt>
      <groupName>IPCT</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_SEND[%s]</name>
          <description>Description collection: Trigger event on IPCT source channel n if there are no active signals present on that channel</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_SEND</name>
              <description>Trigger event on IPCT source channel n if there are no active signals present on that channel</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_ACK[%s]</name>
          <description>Description collection: Flush IPCT sink channel n. Any pending IPCT signal on that channel will
          re-trigger the RECEIVE[n] event. The flush can happen automatically by
          configuring the SHORTS register accordingly.</description>
          <addressOffset>0x040</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_ACK</name>
              <description>Flush IPCT sink channel n. Any pending IPCT signal on that channel will
          re-trigger the RECEIVE[n] event. The flush can happen automatically by
          configuring the SHORTS register accordingly.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SUBSCRIBE_SEND[%s]</name>
          <description>Description collection: Subscribe configuration for task SEND[n]</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task SEND[n] will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SUBSCRIBE_ACK[%s]</name>
          <description>Description collection: Subscribe configuration for task ACK[n]</description>
          <addressOffset>0x0C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task ACK[n] will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_RECEIVE[%s]</name>
          <description>Description collection: Event received on IPCT sink channel n</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_RECEIVE</name>
              <description>Event received on IPCT sink channel n</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_ACKED[%s]</name>
          <description>Description collection: Event received when hardware handshake of SEND task for IPCT 
        source channel n is complete and a new signal can be triggered
        on that channel.</description>
          <addressOffset>0x140</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_ACKED</name>
              <description>Event received when hardware handshake of SEND task for IPCT 
        source channel n is complete and a new signal can be triggered
        on that channel.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PUBLISH_RECEIVE[%s]</name>
          <description>Description collection: Publish configuration for event RECEIVE[n]</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event RECEIVE[n] will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PUBLISH_ACKED[%s]</name>
          <description>Description collection: Publish configuration for event ACKED[n]</description>
          <addressOffset>0x1C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event ACKED[n] will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHORTS</name>
          <description>Shortcuts between local events and tasks</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECEIVE0_ACK0</name>
              <description>Shortcut between event RECEIVE[0] and task ACK[0]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RECEIVE1_ACK1</name>
              <description>Shortcut between event RECEIVE[1] and task ACK[1]</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RECEIVE2_ACK2</name>
              <description>Shortcut between event RECEIVE[2] and task ACK[2]</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RECEIVE3_ACK3</name>
              <description>Shortcut between event RECEIVE[3] and task ACK[3]</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RECEIVE4_ACK4</name>
              <description>Shortcut between event RECEIVE[4] and task ACK[4]</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RECEIVE5_ACK5</name>
              <description>Shortcut between event RECEIVE[5] and task ACK[5]</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RECEIVE6_ACK6</name>
              <description>Shortcut between event RECEIVE[6] and task ACK[6]</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RECEIVE7_ACK7</name>
              <description>Shortcut between event RECEIVE[7] and task ACK[7]</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
