lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_radiocore.svd
        <register>
          <name>CONFIGVOLTLVL</name>
          <description>Configure voltage level for analog input</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable 3.3V on analog input</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ANADETECT</name>
          <description>Analog detect configuration</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ANADETECT</name>
              <description>Analog detect configuration</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Cross</name>
                  <description>Generate ANADETECT on crossing, both upward crossing and downward crossing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Up</name>
                  <description>Generate ANADETECT on upward crossing only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Down</name>
                  <description>Generate ANADETECT on downward crossing only</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HYST</name>
          <description>Comparator hysteresis enable</description>
          <addressOffset>0x538</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HYST</name>
              <description>Comparator hysteresis enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Comparator hysteresis disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Comparator hysteresis enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_COMP_NS">
      <name>GLOBAL_COMP_S</name>
      <description>Comparator 1</description>
      <baseAddress>0x5F983000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>COMP_LPCOMP</name>
        <value>387</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_LPCOMP_NS">
      <name>GLOBAL_LPCOMP_S</name>
      <description>Low-power comparator 1</description>
      <baseAddress>0x5F983000</baseAddress>
      <alternatePeripheral>GLOBAL_COMP_S</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>COMP_LPCOMP</name>
        <value>387</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_TEMP_NS</name>
      <description>Temperature Sensor 0</description>
      <baseAddress>0x4F984000</baseAddress>
      <headerStructName>TEMP</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TEMP</name>
        <value>388</value>
      </interrupt>
      <groupName>TEMP</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Start temperature measurement</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_START</name>
              <description>Start temperature measurement</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop temperature measurement</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_STOP</name>
              <description>Stop temperature measurement</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_START</name>
          <description>Subscribe configuration for task START</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task START will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STOP</name>
          <description>Subscribe configuration for task STOP</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task STOP will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_DATARDY</name>
          <description>Temperature measurement complete, data ready</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_DATARDY</name>
              <description>Temperature measurement complete, data ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_DATARDY</name>
          <description>Publish configuration for event DATARDY</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event DATARDY will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATARDY</name>
              <description>Write '1' to enable interrupt for event DATARDY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATARDY</name>
              <description>Write '1' to disable interrupt for event DATARDY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMP</name>
          <description>Temperature in degC (0.25deg steps)</description>
          <addressOffset>0x508</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <dataType>int32_t</dataType>
          <size>0x20</size>
          <fields>
            <field>
              <name>TEMP</name>
              <description>Temperature in degC (0.25deg steps)</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>A0</name>
          <description>Slope of 1st piece wise linear function</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <resetValue>0x000002D9</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>A0</name>
              <description>Slope of 1st piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>A1</name>
          <description>Slope of 2nd piece wise linear function</description>
          <addressOffset>0x524</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000322</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>A1</name>
              <description>Slope of 2nd piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>A2</name>
          <description>Slope of 3rd piece wise linear function</description>
          <addressOffset>0x528</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000355</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>A2</name>
              <description>Slope of 3rd piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>A3</name>
          <description>Slope of 4th piece wise linear function</description>
          <addressOffset>0x52C</addressOffset>
          <access>read-write</access>
          <resetValue>0x000003DF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>A3</name>
              <description>Slope of 4th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>A4</name>
          <description>Slope of 5th piece wise linear function</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000044E</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>A4</name>
              <description>Slope of 5th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>A5</name>
          <description>Slope of 6th piece wise linear function</description>
          <addressOffset>0x534</addressOffset>
          <access>read-write</access>
          <resetValue>0x000004B7</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>A5</name>
              <description>Slope of 6th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>A6</name>
          <description>Slope of 7th piece wise linear function</description>
          <addressOffset>0x538</addressOffset>
          <access>read-write</access>
          <resetValue>0x000004B7</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>A6</name>
              <description>Slope of 7th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B0</name>
          <description>y-intercept of 1st piece wise linear function</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000FC7</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>B0</name>
              <description>y-intercept of 1st piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B1</name>
          <description>y-intercept of 2nd piece wise linear function</description>
          <addressOffset>0x544</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000F71</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>B1</name>
              <description>y-intercept of 2nd piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B2</name>
          <description>y-intercept of 3rd piece wise linear function</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000F6C</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>B2</name>
              <description>y-intercept of 3rd piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B3</name>
          <description>y-intercept of 4th piece wise linear function</description>
          <addressOffset>0x54C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000FCB</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>B3</name>
              <description>y-intercept of 4th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B4</name>
          <description>y-intercept of 5th piece wise linear function</description>
          <addressOffset>0x550</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000004B</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>B4</name>
              <description>y-intercept of 5th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B5</name>
          <description>y-intercept of 6th piece wise linear function</description>
          <addressOffset>0x554</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000F6</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>B5</name>
              <description>y-intercept of 6th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B6</name>
          <description>y-intercept of 7th piece wise linear function</description>
          <addressOffset>0x558</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000F6</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>B6</name>
              <description>y-intercept of 7th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>T0</name>
          <description>End point of 1st piece wise linear function</description>
          <addressOffset>0x560</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000E1</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>T0</name>
              <description>End point of 1st piece wise linear function</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>T1</name>
          <description>End point of 2nd piece wise linear function</description>
          <addressOffset>0x564</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000F9</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>T1</name>
              <description>End point of 2nd piece wise linear function</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
