lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_radiocore.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_QDEC130_NS">
      <name>GLOBAL_QDEC130_S</name>
      <description>Quadrature Decoder 1</description>
      <baseAddress>0x5F994000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>QDEC130</name>
        <value>404</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_QDEC130_NS">
      <name>GLOBAL_QDEC131_NS</name>
      <description>Quadrature Decoder 2</description>
      <baseAddress>0x4F995000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>QDEC131</name>
        <value>405</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_QDEC130_NS">
      <name>GLOBAL_QDEC131_S</name>
      <description>Quadrature Decoder 3</description>
      <baseAddress>0x5F995000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>QDEC131</name>
        <value>405</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_I2S130_NS">
      <name>GLOBAL_I2S131_NS</name>
      <description>Inter-IC Sound 2</description>
      <baseAddress>0x4F997000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>I2S131</name>
        <value>407</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_I2S130_NS">
      <name>GLOBAL_I2S131_S</name>
      <description>Inter-IC Sound 3</description>
      <baseAddress>0x5F997000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>I2S131</name>
        <value>407</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="DPPIC020_NS">
      <name>GLOBAL_DPPIC133_NS</name>
      <description>Distributed programmable peripheral interconnect controller 10</description>
      <baseAddress>0x4F9A1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="DPPIC020_NS">
      <name>GLOBAL_DPPIC133_S</name>
      <description>Distributed programmable peripheral interconnect controller 11</description>
      <baseAddress>0x5F9A1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="TIMER020_NS">
      <name>GLOBAL_TIMER130_NS</name>
      <description>Timer/Counter 10</description>
      <baseAddress>0x4F9A2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER130</name>
        <value>418</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER020_NS">
      <name>GLOBAL_TIMER130_S</name>
      <description>Timer/Counter 11</description>
      <baseAddress>0x5F9A2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER130</name>
        <value>418</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER020_NS">
      <name>GLOBAL_TIMER131_NS</name>
      <description>Timer/Counter 12</description>
      <baseAddress>0x4F9A3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER131</name>
        <value>419</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER020_NS">
      <name>GLOBAL_TIMER131_S</name>
      <description>Timer/Counter 13</description>
      <baseAddress>0x5F9A3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER131</name>
        <value>419</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PWM120_NS">
      <name>GLOBAL_PWM130_NS</name>
      <description>Pulse width modulation unit 2</description>
      <baseAddress>0x4F9A4000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PWM130</name>
        <value>420</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PWM120_NS">
      <name>GLOBAL_PWM130_S</name>
      <description>Pulse width modulation unit 3</description>
      <baseAddress>0x5F9A4000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PWM130</name>
        <value>420</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM130_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 4</description>
      <baseAddress>0x4F9A5000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL0</name>
        <value>421</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS130_NS</name>
      <description>SPI Slave 2</description>
      <baseAddress>0x4F9A5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM130_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL0</name>
        <value>421</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_TWIM130_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 0</description>
      <baseAddress>0x4F9A5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM130_NS</alternatePeripheral>
      <headerStructName>TWIM</headerStructName>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SERIAL0</name>
        <value>421</value>
      </interrupt>
      <groupName>TWIM</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_STARTRX</name>
          <description>Start TWI receive sequence</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_STARTRX</name>
              <description>Start TWI receive sequence</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STARTTX</name>
          <description>Start TWI transmit sequence</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_STARTTX</name>
              <description>Start TWI transmit sequence</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop TWI transaction. Must be issued while the TWI master is not suspended.</description>
          <addressOffset>0x014</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_STOP</name>
              <description>Stop TWI transaction. Must be issued while the TWI master is not suspended.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_SUSPEND</name>
          <description>Suspend TWI transaction</description>
          <addressOffset>0x01C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_SUSPEND</name>
              <description>Suspend TWI transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_RESUME</name>
          <description>Resume TWI transaction</description>
          <addressOffset>0x020</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_RESUME</name>
              <description>Resume TWI transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STARTRX</name>
          <description>Subscribe configuration for task STARTRX</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task STARTRX will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STARTTX</name>
          <description>Subscribe configuration for task STARTTX</description>
          <addressOffset>0x088</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task STARTTX will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STOP</name>
          <description>Subscribe configuration for task STOP</description>
          <addressOffset>0x094</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task STOP will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_SUSPEND</name>
          <description>Subscribe configuration for task SUSPEND</description>
          <addressOffset>0x09C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task SUSPEND will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_RESUME</name>
          <description>Subscribe configuration for task RESUME</description>
          <addressOffset>0x0A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task RESUME will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_STOPPED</name>
          <description>TWI stopped</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_STOPPED</name>
              <description>TWI stopped</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_ERROR</name>
          <description>TWI error</description>
          <addressOffset>0x124</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_ERROR</name>
              <description>TWI error</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_SUSPENDED</name>
          <description>SUSPEND task has been issued, TWI traffic is now suspended.</description>
          <addressOffset>0x148</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_SUSPENDED</name>
              <description>SUSPEND task has been issued, TWI traffic is now suspended.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RXSTARTED</name>
          <description>Receive sequence started</description>
          <addressOffset>0x14C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_RXSTARTED</name>
              <description>Receive sequence started</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_TXSTARTED</name>
          <description>Transmit sequence started</description>
          <addressOffset>0x150</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_TXSTARTED</name>
              <description>Transmit sequence started</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_LASTRX</name>
          <description>Byte boundary, starting to receive the last byte</description>
          <addressOffset>0x15C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_LASTRX</name>
              <description>Byte boundary, starting to receive the last byte</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
